---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailElementOrderUtils
source: html/3fea0ffe-7cfb-e785-fe50-8b7dbde86935.htm
---
# DetailElementOrderUtils Members

Indicates if the elements are all detail elements that participate in detail draw ordering in the view.